//
//  CardType.swift
//  Nonlimit
//
//  Created by Designer on 2025/5/24.
//

import SwiftUI

enum CardType: CaseIterable {
    case work
    case love
    case future
    case lunch
    case drink
    
    var animationName: String {
        switch self {
        case .work: return "work-result.json"
        case .love: return "love-result.json"
        case .future: return "future-result.json"
        case .lunch: return "lunch-result.json"
        case .drink: return "drink-result.json"
        }
    }
    
    var messages: [String] {
        switch self {
        case .work:
            return [
                "要記得打卡",
                "領完年終再走",
                "先跑就對了！",
                "該下班了",
                "不是你的問題",
                "相信你的直覺",
                "這裡不是你該待的地方",
                "放棄吧",
                "你值得更好的",
                "別把別人的錯留在你心上",
                "不要浪費時間在不重要的人身上",
                "準時下班是基本人權",
                "躺著也能活下去",
                "你不是來還債的",
                "請遠離有毒的人和環境",
                "不要再委屈自己",
                "累了就休息，不需要證明什麼",
                "薪水不是愛的證明",
                "他們不會改變，但你可以離開",
                "你早就知道答案了",
                "一切只是時間問題",
                "逃跑也是一種勇敢",
                "只做有感覺的事情",
                "你不是機器人（機器人都沒有你廉價⋯）",
                "別把忠誠給了錯的地方",
                "可以離開是一種福氣",
                "請安靜離開",
                "再晚也要為自己出發",
                "你值得被善待",
                "你的健康不在 KPI 裡",
                "撐過這週，再想未來",
                "離職信草稿可以先寫了",
                "這種疲憊不是休假能解決的",
                "他們需要你，但你不需要他們",
                "如果猶豫，那就是答案了",
                "繼續下去，只會更空虛",
                "你不欠任何人",
                "該請特休了",
                "比上不足，比下有餘",
                "該來的還是會來",
                "你可以提離職了（還在等什麼？）",
                "AI 早晚會取代你的",
                "苟且偷生也不錯",
                "不要再苟延殘喘了..",
            ]
        case .love:
            return [
                "感情的問題一律建議分手",
                "單身比和錯的人在一起更好",
                "愛真的需要勇氣",
                "下一個會更好",
                "顯而易見",
                "當然",
                "怎麼可能",
                "相信你的直覺",
                "先脫貧再脫單",
                "他沒有那麼喜歡你",
                "放過對方，也是放過自己",
                "你值得更好的愛",
                "愛你的人，不會讓你猜來猜去",
                "你擁抱的並不總是也擁抱你",
                "別讓喜歡蒙蔽雙眼",
                "再喜歡也別忘了底線",
                "你喜歡的不是他，是對他的幻想",
                "被需要，不等於被愛",
                "愛自己，才能愛對方",
                "沒有期待就沒有傷害",
                "不要在錯的人身上證明自己的價值",
                "會主動的才值得留在你生命裡",
                "委屈求來的愛不會長久",
                "錯的人，努力也白費",
                "別為了誰而改變自己",
                "曖昧讓人受盡委屈",
                "找不到相愛的證據",
                "愛情來得太快就像龍捲風",
                "愛要耐心等待，仔細尋找，感覺很重要",
                "別再幫對方找藉口了",
                "你可以找到更好的",
                "其實愛對了人，情人節每天都過",
            ]
        case .future:
            return [
                "一切都是過程",
                "活著不難，最難的是做人",
                "別怕未來，你可能撐不到那麼遠",
                "態度決定你的高度",
                "好好休息",
                "沒有比較就沒有傷害",
                "人生的意義在於感受迷惘",
                "該買機票了",
                "你需要出國一趟",
                "慢慢來比較快",
                "船到橋頭自然直",
                "舊的不去新的不來",
                "專注呼吸就好",
                "放下它",
                "接受它",
                "多得是～～你不知道的事",
                "速度會帶來平衡",
                "走得慢沒關係，方向對就好",
                "答案在路上，不在腦袋裡",
                "路會自己出現",
                "有時候逃跑也是一種前進",
                "未來不是要想清楚，而是走出來的",
                "不要預設困難，也別預設失敗",
                "該來的會來，該走的也會走",
                "想不通，就先睡一覺",
                "應無所住而生其心",
                "Namaste🙏",
                "你已經在路上了",
                "這段混亂有它的意義",
                "直覺會帶你回家",
                "聽聽薦骨的聲音",
                "平靜，就是指引",
                "別急著完成，先學會感受",
                "放棄掌控，會比較快樂",
                "我們並不是年年變老，而是每天變新。",
                "不需要答案，也可以繼續生活",
                "過不去的不是事，是情緒",
                "跌倒不可怕，怕的是不敢再走",
                "選影響遠一點的",
                "即時行樂",
                "Be a voice, not an echo.",
            ]
        case .lunch:
            return [
                "拉麵 🍜",
                "鐵板麵 🍝",
                "肉羹麵 🍜",
                "牛肉麵 🍜",
                "炒麵 🍝",
                "粄條 🍜",
                
                "麥當勞 🍟",
                "肯德基 🍗",
                "頂呱呱 🍗",
                "摩斯漢堡 🍔",
                "Subway 🌯",
                "必勝客 🍕",
                
                "石二鍋 🍲",
                "瓦城 🫕",
                "小蒙牛 🐮",
                "八方雲集水餃 🥟",
                "四海遊龍鍋貼 🥟",
                "鼎泰豐小籠包 🥟",
                "路易莎 🥪",
                "春水堂 🧋",
                "水煎包 🥟",
                
                "咖哩飯 🍛",
                "三明治 🥪",
                "義大利麵 🍝",
                "壽司郎 🍣",
                "爭鮮 🍣",
                
                "雞腿便當 🍗",
                "排骨便當 🍱",
                "韓式拌飯 🥢",
                "鬍鬚張滷肉飯 🍚",

                "麵包 🥖",
                "燒肉丼 🍖",
                "炒飯 🍳",
                "壽喜燒 🫕",
                "墨西哥捲餅 🌯",
                "煎牛排 🥩",
                "涓豆腐 🫕🇰🇷",
               
                "滷味 🍢",
                "蚵仔煎 🦪🍳",
                "炒米粉 🍝",
                "海南雞飯 🍚🐔",
                "泰式打拋豬 🌶️🐷",
                "越南河粉 🍜🥬",
                "蛋餅 🍳",
                "便利商店微波便當 🏪",
                "超商三角飯糰 🍙",
                "不要吃了，省錢 💰",
                
            ]
            
        case .drink:
            return [
                "50嵐 珍珠奶茶",
                "50嵐 黃金烏龍拿鐵+波霸",
                "50嵐 四季春＋珍波椰",
                "50嵐 四季奶青",
                
                "得正 焙烏龍奶茶",
                
                "一沐日 油切蕎麥茶＋粉粿",
                "一沐日 蕎麥鮮奶茶",
                
                "迷客夏 珍珠紅茶拿鐵",
                
                "八曜和茶 柚香覺醒 307",
                "八曜和茶 牧場 308",
                
                "清心福全 烏龍綠茶",
                "清心福全 優多綠茶",

                "麻古茶坊 楊枝甘露",
                
                "五桐號 綠茶凍奶茶",
                
                "龜記 紅柚翡翠",
                
                "星巴克（有買一送一再買）",
                "7-11 拿鐵",
                "全家 拿鐵",
              
                "喝水就好 💧",
            ]

        }
    }
}

